In [ ]:
import numpy as np
import pandas as pd

from sklearn.datasets import load_iris, fetch_openml
iris = load_iris()

titanic = fetch_openml(name='Titanic', version=1)
titanic = pd.concat([titanic['data'], titanic['target']], axis=1)

/usr/local/lib/python3.9/dist-packages/sklearn/datasets/_openml.py:932: FutureWarning: The default value of `parser` will change from `'liac-arff'` to `'auto'` in 1.4. You can set `parser='auto'` to silence this warning. Therefore, an `ImportError` will be raised from 1.4 if the dataset is dense and pandas is not installed. Note that the pandas parser may return different data types. See the Notes Section in fetch_openml's API doc for details.
  warn(

# Iris plants dataset

**Data Set Characteristics:**

    :Number of Instances: 150 (50 in each of three classes)
    :Number of Attributes: 4 numeric, predictive attributes and the class
    :Attribute Information:
        - sepal length in cm
        - sepal width in cm
        - petal length in cm
        - petal width in cm
        - class:
                - Iris-Setosa
                - Iris-Versicolour
                - Iris-Virginica

**Problem 1.⭐**
After running the box below, the following variables will be created:

* data $\rightarrow$ $150 \times 4$ numpy array

* list of feature_names $\rightarrow$ strings consisting of 4 elements

* target $\rightarrow$ numpy array of size $150$

* target_names $\rightarrow$ list of strings consisting of 3 elements.

  It is required to write a ``get_data_frame'' function that will create a pandas DataFrame with 5 columns and 150 rows such that

  * the contents of the ``data'' variable should be written in the first 4 columns, and the names of the columns should be the elements of 'feature_names' (in the given order)
  * and the fifth column, called "target name", should have ``target`` in the column, but instead of each number, the element with the corresponding index of ``target_names'' should be written.

The first 5 rows of the final DataFrame will look like this:
```
	sepal length (cm)	sepal width (cm)	petal length (cm)	petal width (cm)	target name
0	     5.1             	3.5	                1.4	           0.2	          setosa
1	     4.9            	 3.0                	1.4           	0.2	          setosa
2	     4.7             	3.2                	1.3           	0.2	          setosa
3	     4.6	             3.1                	1.5           	0.2	          setosa
4	     5.0             	3.6                	1.4           	0.2	          setosa
```

**The resulting DataFrame will be used in subsequent problems**։

In [ ]:
def get_data_frame(data, feature_names, target, target_names):
  df = pd.DataFrame(data=data, columns=feature_names)
  df['target_name'] = target_names[target]
  return df

In [ ]:
df = get_data_frame(data=iris['data'],
                    feature_names=iris['feature_names'],
                    target=iris['target'],
                    target_names=iris['target_names'])
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target_name
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica
146,6.3,2.5,5.0,1.9,virginica
147,6.5,3.0,5.2,2.0,virginica
148,6.2,3.4,5.4,2.3,virginica
149,5.9,3.0,5.1,1.8,virginica

**Problem 2.⭐⭐** In the ``df'' table obtained in the previous question, the length and width of the flower petals (corolla and sepal) and the corresponding flower number are written. {'setosa', 'versicolor', 'virginica'} species coded with {0,1,2} numbers.

![picture](https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcRaU43Ra3xTYTpU2XLBw5yl20Qty3OCJzjDBw&usqp=CAU)

Create a function called ``get_stats'' that, using the ``pd.group_by'' function, will count the number of petals (petals and sepals) of each flower type.

1. average length
2. the average width
3. Minimum length
4. Minimum width
5. Maximum length
6. Maximum width

and will return a pandas DataFrame with the columns as the result

```python
["mean sepal length (cm)", "mean petal length (cm)", "mean sepal width (cm)", "mean petal width (cm)", "min sepal length (cm)", "min petal length (cm)", "min sepal width (cm)", "min petal width (cm)", "max sepal length (cm)", "max petal length (cm)", "max sepal width (cm)", "max petal width (cm)"]
```
and the types of flowers will be the index names.

In [ ]:
def get_stats(df):
  column_names = ["mean sepal length (cm)", "mean sepal width (cm)", "mean petal length (cm)", "mean petal width (cm)", "min sepal length (cm)", "min sepal width (cm)", "min petal length (cm)", "min petal width (cm)", "max sepal length (cm)", "max sepal width (cm)", "max petal length (cm)", "max petal width (cm)"]
  grouped_df = df.groupby(by=['target_name'])
  final_df = pd.concat([grouped_df.mean(),  grouped_df.max(), grouped_df.min()], axis=1)
  final_df.columns = column_names
  return final_df

In [ ]:
df_stats = get_stats(df)
print(df_stats)

             mean sepal length (cm)  mean sepal width (cm)  \
target_name
setosa                        5.006                  3.428
versicolor                    5.936                  2.770
virginica                     6.588                  2.974

             mean petal length (cm)  mean petal width (cm)  \
target_name
setosa                        1.462                  0.246
versicolor                    4.260                  1.326
virginica                     5.552                  2.026

             min sepal length (cm)  min sepal width (cm)  \
target_name
setosa                         5.8                   4.4
versicolor                     7.0                   3.4
virginica                      7.9                   3.8

             min petal length (cm)  min petal width (cm)  \
target_name
setosa                         1.9                   0.6
versicolor                     5.1                   1.8
virginica                      6.9                   2.5

             max sepal length (cm)  max sepal width (cm)  \
target_name
setosa                         4.3                   2.3
versicolor                     4.9                   2.0
virginica                      4.9                   2.2

             max petal length (cm)  max petal width (cm)
target_name
setosa                         1.0                   0.1
versicolor                     3.0                   1.0
virginica                      4.5                   1.4

**Problem 3.⭐⭐** Add the ``remove_small_flowers`` function, which will delete from the ``df`` table those rows whose 'sepal width' is smaller than the average of its type (using ``df_stats'' calculations from the previous problem).

In [ ]:
def remove_small_flowers(df, df_stats):
  removed_df = df[df['sepal width (cm)'] >= df_stats.loc[df['target_name']]['mean sepal width (cm)'].values]
  return removed_df

In [ ]:
df = remove_small_flowers(df, df_stats)
print(df)

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)  \
0                  5.1               3.5                1.4               0.2
4                  5.0               3.6                1.4               0.2
5                  5.4               3.9                1.7               0.4
10                 5.4               3.7                1.5               0.2
14                 5.8               4.0                1.2               0.2
..                 ...               ...                ...               ...
144                6.7               3.3                5.7               2.5
145                6.7               3.0                5.2               2.3
147                6.5               3.0                5.2               2.0
148                6.2               3.4                5.4               2.3
149                5.9               3.0                5.1               1.8

    target_name
0        setosa
4        setosa
5        setosa
10       setosa
14       setosa
..          ...
144   virginica
145   virginica
147   virginica
148   virginica
149   virginica

[80 rows x 5 columns]

# Titanic

You can read about the Titanic dataset [here](https://www.kaggle.com/competitions/titanic/data)։

**Problem 4.⭐** Complete the ``problem4`` function so that it returns the data of men satisfying the following conditions as a dataframe,
* whose full name contains the words ``ian`` or ``yan``,
* whose pclass=3 and embarked=C

In [ ]:
def problem4(data):
  return data.loc[data['name'].str.contains('ian|yan') & (data['pclass'] == 3) & (data['embarked'] == 'C')]

In [ ]:
print(problem4(data=titanic))

      pclass                                   name     sex   age  sibsp  \
647      3.0  Assaf Khalil, Mrs. Mariana ('Miriam')  female  45.0    0.0
941      3.0                  Krekorian, Mr. Neshan    male  25.0    0.0
994      3.0                Mardirosian, Mr. Sarkis    male   NaN    0.0
1201     3.0                  Sirayanian, Mr. Orsen    male  22.0    0.0
1277     3.0                   Vartanian, Mr. David    male  22.0    0.0
1306     3.0              Zakarian, Mr. Mapriededer    male  26.5    0.0
1307     3.0                    Zakarian, Mr. Ortin    male  27.0    0.0

      parch ticket    fare  cabin embarked   boat   body   home.dest survived
647     0.0   2696  7.2250   None        C      C    NaN  Ottawa, ON        1
941     0.0   2654  7.2292  F E57        C     10    NaN        None        1
994     0.0   2655  7.2292  F E46        C   None    NaN        None        0
1201    0.0   2669  7.2292   None        C   None    NaN        None        0
1277    0.0   2658  7.2250   None        C  13 15    NaN        None        1
1306    0.0   2656  7.2250   None        C   None  304.0        None        0
1307    0.0   2670  7.2250   None        C   None    NaN        None        0

**Problem 5.⭐⭐** Complete the function ``problem5`` which
  * should return data for all passengers whose age data was missing from the original data as well

* fill in missing ages according to the mean age of the corresponding pclass

In [ ]:
def problem5(data):
  nan_ages = titanic[titanic['age'].isna()]
  titanic['age'].fillna(titanic.groupby(by=['pclass'])['age'].mean())
  return nan_ages

In [ ]:
print(problem5(data=titanic))

      pclass                                               name     sex  age  \
15       1.0                                Baumann, Mr. John D    male  NaN
37       1.0      Bradley, Mr. George ('George Arthur Brayton')    male  NaN
40       1.0                          Brewe, Dr. Arthur Jackson    male  NaN
46       1.0                              Cairns, Mr. Alexander    male  NaN
59       1.0  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...  female  NaN
...      ...                                                ...     ...  ...
1293     3.0                  Williams, Mr. Howard Hugh 'Harry'    male  NaN
1297     3.0                             Wiseman, Mr. Phillippe    male  NaN
1302     3.0                                  Yousif, Mr. Wazli    male  NaN
1303     3.0                              Yousseff, Mr. Gerious    male  NaN
1305     3.0                              Zabour, Miss. Thamine  female  NaN

      sibsp  parch      ticket     fare cabin embarked  boat body  \
15      0.0    0.0    PC 17318  25.9250  None        S  None  NaN
37      0.0    0.0      111427  26.5500  None        S     9  NaN
40      0.0    0.0      112379  39.6000  None        C  None  NaN
46      0.0    0.0      113798  31.0000  None        S  None  NaN
59      0.0    0.0       17770  27.7208  None        C     5  NaN
...     ...    ...         ...      ...   ...      ...   ...  ...
1293    0.0    0.0    A/5 2466   8.0500  None        S  None  NaN
1297    0.0    0.0  A/4. 34244   7.2500  None        S  None  NaN
1302    0.0    0.0        2647   7.2250  None        C  None  NaN
1303    0.0    0.0        2627  14.4583  None        C  None  NaN
1305    1.0    0.0        2665  14.4542  None        C  None  NaN

             home.dest survived
15        New York, NY        0
37     Los Angeles, CA        1
40    Philadelphia, PA        0
46                None        0
59        New York, NY        1
...                ...      ...
1293              None        0
1297              None        0
1302              None        0
1303              None        0
1305              None        0

[263 rows x 14 columns]

**Problem 6.⭐⭐** Complete the ``problem6`` function so that it returns such a dataframe, where instead of x there are the averages of the corresponding values of the survived characteristic.

|pclass | sex  | avg(survived) |  
|-----|--------| ------------- |
|1    | male       |      x        |
|2    | male       |      x        |
|3    | male       |      x        |
|1    | female       |      x        |
|2    | female       |      x        |
|3    | female       |      x        |

In [ ]:
def problem6(data):
  data['numeric_survived'] = data['survived'].astype(int)
  grouped_df = data.groupby(by=['pclass', 'sex'])
  res_df = pd.DataFrame(grouped_df.groups.keys(), columns = ['pclass', 'sex'])
  res_df['avg(survived)'] = grouped_df.mean()['numeric_survived'].values
  return res_df

In [ ]:
print(problem6(data=titanic))

   pclass     sex  avg(survived)
0     1.0  female       0.965278
1     1.0    male       0.340782
2     2.0  female       0.886792
3     2.0    male       0.146199
4     3.0  female       0.490741
5     3.0    male       0.152130

**Problem 7.⭐⭐** Fill in the ``problem7`` function, which should return the columns with missing data by prefilling them as follows:
* all columns with values in the first row must be filled in by taking the value immediately before the missing value
* all columns with values in the last row must be filled by taking the value immediately after the missing value
* if the above 2 conditions are met, then the missing values must be filled
   * with the arithmetic mean of the values in the first and last rows (for numeric columns)
   * with the first available data (not for numeric columns)
* if the first 2 conditions are not fulfilled, then fill the missing data with the last available data of the given column.

In [ ]:
def problem7(data):
  nan_cols = data.columns[data.isna().any()].tolist()

  for nan_col in nan_cols:
    if pd.notnull(data.loc[0, nan_col]) and pd.notnull(data.loc[data.shape[0]-1, nan_col]):
      if pd.api.types.is_numeric_dtype(data.loc[:,nan_col]):
        first_val = data.loc[0, nan_col]
        last_val = data.loc[df.shape[0]-1, nan_col]
        data.loc[:, nan_col].fillna((first_val+last_val)/2, inplace=True)
      else:
        # first_not_nan_idx = data.loc[:,nan_col].first_valid_index()
        # first_not_nan = data.loc[:,nan_col].loc[first_not_nan_idx]
        data.loc[:, nan_col].fillna(data.loc[0, nan_col], inplace=True)
    elif pd.notnull(data.loc[0, nan_col]):
      data.loc[:, nan_col].fillna(method='ffill', inplace=True)
    elif pd.notnull(data.loc[data.shape[0]-1, nan_col]):
      data.loc[:, nan_col].fullna(method='bfill', inplace=True)
    else:
      last_not_nan = data.loc[data.last_valid_index()]
      data.loc[:, nan_col].fillna(last_not_nan, inplace=True)

  return nan_cols

In [ ]:
print(problem7(data=titanic))

['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest']

**Problem 8.⭐⭐** Complete the function below so that it returns the ``titanic`` dataset with row length pandas.Series, where each row value is
* the product of the length (excluding spaces) of the passenger name of that string, pclass, and age, if age is present, and
* otherwise, the age of the passenger with the longest name in the total

In [ ]:
def problem8(data):
  res = pd.Series([np.nan] * data.shape[0], index=range(data.shape[0]))
  not_nan_indices = data['age'].notnull().to_numpy().nonzero()[0]
  name_lens = data.loc[not_nan_indices, 'name'].str.strip().str.replace(' ', '').apply(lambda x: len(x))
  res[not_nan_indices] = name_lens * data.loc[not_nan_indices, 'pclass'] * data.loc[not_nan_indices, 'age']
  fill_value = data.loc[name_lens.argmax(), 'age']
  res.fillna(fill_value, inplace=True)

  return res

In [ ]:
res = problem8(data=titanic)
print(problem8(data=titanic))

0        754.0000
1         24.7509
2         50.0000
3        960.0000
4       1000.0000
          ...
1304     783.0000
1305    2394.0000
1306    1828.5000
1307    1377.0000
1308    1392.0000
Length: 1309, dtype: float64

**Problem 9.⭐⭐** The result of problem9 should be the arithmetic mean of the ages of the passengers who bought the most expensive ticket.

In [ ]:
def problem9(data):
  return data.loc[data['fare'][data['fare'] == data['fare'].max()].index, 'age'].mean()

In [ ]:
print(problem9(data=titanic))

41.0

**Problem 10.⭐⭐** Add the row you created in Problem 8 to the original data as the first column named "Col1".

In [ ]:
def problem10(data):
  res = problem8(data)
  data['Col1'] = res
  return data

In [ ]:
print(problem10(data=titanic))

      pclass                                             name     sex  \
0        1.0                    Allen, Miss. Elisabeth Walton  female
1        1.0                   Allison, Master. Hudson Trevor    male
2        1.0                     Allison, Miss. Helen Loraine  female
3        1.0             Allison, Mr. Hudson Joshua Creighton    male
4        1.0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...      ...                                              ...     ...
1304     3.0                             Zabour, Miss. Hileni  female
1305     3.0                            Zabour, Miss. Thamine  female
1306     3.0                        Zakarian, Mr. Mapriededer    male
1307     3.0                              Zakarian, Mr. Ortin    male
1308     3.0                               Zimmerman, Mr. Leo    male

          age  sibsp  parch  ticket      fare    cabin embarked boat   body  \
0     29.0000    0.0    0.0   24160  211.3375       B5        S    2    NaN
1      0.9167    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
2      2.0000    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
3     30.0000    1.0    2.0  113781  151.5500  C22 C26        S   11  135.0
4     25.0000    1.0    2.0  113781  151.5500  C22 C26        S   11    NaN
...       ...    ...    ...     ...       ...      ...      ...  ...    ...
1304  14.5000    1.0    0.0    2665   14.4542      F38        C    C  328.0
1305  42.0000    1.0    0.0    2665   14.4542      F38        C    C    NaN
1306  26.5000    0.0    0.0    2656    7.2250      F38        C    C  304.0
1307  27.0000    0.0    0.0    2670    7.2250      F38        C    C    NaN
1308  29.0000    0.0    0.0  315082    7.8750      F38        S    C    NaN

                            home.dest survived       Col1
0                        St Louis, MO        1   754.0000
1     Montreal, PQ / Chesterville, ON        1    24.7509
2     Montreal, PQ / Chesterville, ON        0    50.0000
3     Montreal, PQ / Chesterville, ON        0   960.0000
4     Montreal, PQ / Chesterville, ON        0  1000.0000
...                               ...      ...        ...
1304   Antwerp, Belgium / Stanton, OH        0   783.0000
1305   Antwerp, Belgium / Stanton, OH        0  2394.0000
1306   Antwerp, Belgium / Stanton, OH        0  1828.5000
1307   Antwerp, Belgium / Stanton, OH        0  1377.0000
1308   Antwerp, Belgium / Stanton, OH        0  1392.0000

[1309 rows x 15 columns]